# Выведите пирамиду из символов «*» заданной высоты. 3
#     *
#    ***
#   *****
n = int(input())
k = 1
for i in range(n):
    print(' '*(n - 1 - i), '*'*k, sep= '')
    k += 2